Ran Plan for dir: `deploy/cs-simulator/sdbx/cs-simulator-app-instances` workspace: `default`

<details><summary>Show Output</summary>

```diff
Setting up Git authentication...

Verifying Git Authentication...

module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.app-access: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.app-access: Read complete after 0s [id=49152838]
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.app-access: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_lb.alb: Read complete after 0s [id=arn:aws:elasticloadbalancing:eu-west-1:192351105085:loadbalancer/app/obornes-sdbx/f23772b0b8aa0d65]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.app-access: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.app-access: Read complete after 0s [id=49152838]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.app-access: Read complete after 0s [id=49152838]
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.ses-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.app-access: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.app-access: Read complete after 0s [id=49152838]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_lb.alb: Read complete after 0s [id=arn:aws:elasticloadbalancing:eu-west-1:192351105085:loadbalancer/app/obornes-sdbx/f23772b0b8aa0d65]
module.ecs_simulator["FR-ORV-A0002"].data.aws_lb.alb: Read complete after 0s [id=arn:aws:elasticloadbalancing:eu-west-1:192351105085:loadbalancer/app/obornes-sdbx/f23772b0b8aa0d65]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.ses-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.ses-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.ses-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_lb.alb: Read complete after 0s [id=arn:aws:elasticloadbalancing:eu-west-1:192351105085:loadbalancer/app/obornes-sdbx/f23772b0b8aa0d65]
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.ses-policy-data: Read complete after 0s [id=2548735024]
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.secrets: Reading...
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.ses-policy-data: Read complete after 0s [id=2548735024]
module.ecs_simulator["FR-ORV-A0002"].data.aws_caller_identity.current: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.ses-policy-data: Read complete after 0s [id=2548735024]
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.secrets: Read complete after 0s [id=1456831710]
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.ses-policy-data: Read complete after 0s [id=2548735024]
module.ecs_simulator["FR-ORV-A0001"].data.aws_caller_identity.current: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_caller_identity.current: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.secrets: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.secrets: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_caller_identity.current: Read complete after 0s [id=192351105085]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_caller_identity.current: Reading...
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.secrets: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.secrets: Read complete after 0s [id=1456831710]
module.ecs_simulator["FR-ORV-A0004"].data.aws_caller_identity.current: Read complete after 0s [id=192351105085]
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.secrets: Read complete after 0s [id=1456831710]
module.ecs_simulator["FR-ORV-A0001"].data.aws_caller_identity.current: Read complete after 0s [id=192351105085]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_caller_identity.current: Read complete after 0s [id=192351105085]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.secrets: Read complete after 0s [id=1456831710]
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.opentelemetry-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_ecs_cluster.ecs_cluster: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_vpc.main: Read complete after 0s [id=vpc-0cc8ac83482581a51]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_vpc.main: Read complete after 0s [id=vpc-0cc8ac83482581a51]
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.opentelemetry-policy-data: Read complete after 0s [id=670946708]
module.ecs_simulator["FR-ORV-A0001"].data.aws_vpc.main: Read complete after 0s [id=vpc-0cc8ac83482581a51]
module.ecs_simulator["FR-ORV-A0004"].data.aws_ecs_cluster.ecs_cluster: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_ecs_cluster.ecs_cluster: Reading...
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_ecs_cluster.ecs_cluster: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.opentelemetry-policy-data: Reading...
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.opentelemetry-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.opentelemetry-policy-data: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.opentelemetry-policy-data: Read complete after 0s [id=670946708]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.opentelemetry-policy-data: Read complete after 0s [id=670946708]
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.opentelemetry-policy-data: Read complete after 0s [id=670946708]
module.ecs_simulator["FR-ORV-A0002"].data.aws_vpc.main: Read complete after 0s [id=vpc-0cc8ac83482581a51]
module.ecs_simulator["FR-ORV-A0002"].data.aws_ecs_cluster.ecs_cluster: Read complete after 0s [id=arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_ecs_cluster.ecs_cluster: Read complete after 0s [id=arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx]
module.ecs_simulator["FR-ORV-A0001"].data.aws_ecs_cluster.ecs_cluster: Read complete after 0s [id=arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx]
module.ecs_simulator["FR-ORV-A0004"].data.aws_ecs_cluster.ecs_cluster: Read complete after 0s [id=arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx]
module.ecs_simulator["FR-ORV-A0002"].data.aws_subnets.private: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_subnets.private: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_subnets.private: Reading...
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_subnets.private: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.parameters: Reading...
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.parameters: Reading...
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.parameters: Reading...
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.parameters: Reading...
module.ecs_simulator["FR-ORV-A0001"].data.aws_iam_policy_document.parameters: Read complete after 0s [id=10378350]
module.ecs_simulator["FR-ORV-A0004"].data.aws_iam_policy_document.parameters: Read complete after 0s [id=10378350]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_iam_policy_document.parameters: Read complete after 0s [id=10378350]
module.ecs_simulator["FR-ORV-A0002"].data.aws_iam_policy_document.parameters: Read complete after 0s [id=10378350]
module.ecs_simulator["FR-ORV-A0004"].data.aws_subnets.private: Read complete after 0s [id=eu-west-1]
module.ecs_simulator["FR-ORV-A0001"].data.aws_subnets.private: Read complete after 0s [id=eu-west-1]
module.ecs_simulator["FR-ORV-A0002"].data.aws_subnets.private: Read complete after 0s [id=eu-west-1]
module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].data.aws_subnets.private: Read complete after 0s [id=eu-west-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_ecs_service.service-definition will be created
+ resource "aws_ecs_service" "service-definition" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-cs-FR-ORV-4901-AA001-5-AC"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = false
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0090fb2d3bfc17fc5",
              + "subnet-021e5d9037c4f1832",
              + "subnet-0fa808640b5ce66b5",
            ]
        }
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_ecs_task_definition.task-definition will be created
+ resource "aws_ecs_task_definition" "task-definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + environment      = [
                      + {
                          + name  = "CP_ID"
                          + value = "FR*ORV*4901*AA001*5*AC"
                        },
                      + {
                          + name  = "ENV"
                          + value = "sdbx"
                        },
                      + {
                          + name  = "WS_URL"
                          + value = "ws://server.16.ocpp.obornes.solidstudio.io"
                        },
                    ]
                  + essential        = true
                  + image            = "192351105085.dkr.ecr.eu-west-1.amazonaws.com/simulator:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-cs-FR-ORV-4901-AA001-5-AC"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "logs"
                        }
                    }
                  + memory           = 512
                  + name             = "cs-FR-ORV-4901-AA001-5-AC"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:eu-west-1:192351105085:secret:cs_simulator/cp_password-XPcOCk:cp_password::"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-cs-FR-ORV-4901-AA001-5-AC"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_policy.app-access-policy will be created
+ resource "aws_iam_policy" "app-access-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-app-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_policy.log-driver-policy will be created
+ resource "aws_iam_policy" "log-driver-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-log-drive-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_policy.opentelemetry-policy will be created
+ resource "aws_iam_policy" "opentelemetry-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-opentelemetry-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_policy.parameters-policy will be created
+ resource "aws_iam_policy" "parameters-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-parameters-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-west-1:192351105085:parameter/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_policy.secrets-policy will be created
+ resource "aws_iam_policy" "secrets-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_policy.ses-policy will be created
+ resource "aws_iam_policy" "ses-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ses-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role.ecs_execution_role_main will be created
+ resource "aws_iam_role" "ecs_execution_role_main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role.ecs_task_role_main will be created
+ resource "aws_iam_role" "ecs_task_role_main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_execution_role_main_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_execution_role_main_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-execution-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_execution_role_secrets_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_execution_role_secrets_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-execution-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_base_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_base_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_cloudwatch_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_cloudwatch_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_main_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_main_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_main_telemetry_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_main_telemetry_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_parameters_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_parameters_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_secrets_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_secrets_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_ses_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_ses_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_iam_role_policy_attachment.ecs_task_role_ssm_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_ssm_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-4901-AA001-5-AC"].aws_security_group.service-sg will be created
+ resource "aws_security_group" "service-sg" {
      + arn                    = (known after apply)
      + description            = "Security group for App obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-cs-FR-ORV-4901-AA001-5-AC"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "obornes-sdbx-cs-FR-ORV-4901-AA001-5-AC-cs-FR-ORV-4901-AA001-5-AC"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0cc8ac83482581a51"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_ecs_service.service-definition will be created
+ resource "aws_ecs_service" "service-definition" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "obornes-sdbx-cs-FR-ORV-A0001-cs-FR-ORV-A0001"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = false
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0090fb2d3bfc17fc5",
              + "subnet-021e5d9037c4f1832",
              + "subnet-0fa808640b5ce66b5",
            ]
        }
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_ecs_task_definition.task-definition will be created
+ resource "aws_ecs_task_definition" "task-definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + environment      = [
                      + {
                          + name  = "CP_ID"
                          + value = "FR*ORV*A0001"
                        },
                      + {
                          + name  = "ENV"
                          + value = "sdbx"
                        },
                      + {
                          + name  = "WS_URL"
                          + value = "ws://server.16.ocpp.obornes.solidstudio.io"
                        },
                    ]
                  + essential        = true
                  + image            = "192351105085.dkr.ecr.eu-west-1.amazonaws.com/simulator:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "obornes-sdbx-cs-FR-ORV-A0001-cs-FR-ORV-A0001"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "logs"
                        }
                    }
                  + memory           = 512
                  + name             = "cs-FR-ORV-A0001"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:eu-west-1:192351105085:secret:cs_simulator/cp_password-XPcOCk:cp_password::"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "obornes-sdbx-cs-FR-ORV-A0001-cs-FR-ORV-A0001"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_policy.app-access-policy will be created
+ resource "aws_iam_policy" "app-access-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0001-ecs-app-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_policy.log-driver-policy will be created
+ resource "aws_iam_policy" "log-driver-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0001-ecs-log-drive-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_policy.opentelemetry-policy will be created
+ resource "aws_iam_policy" "opentelemetry-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0001-opentelemetry-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_policy.parameters-policy will be created
+ resource "aws_iam_policy" "parameters-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0001-parameters-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-west-1:192351105085:parameter/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_policy.secrets-policy will be created
+ resource "aws_iam_policy" "secrets-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0001-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_policy.ses-policy will be created
+ resource "aws_iam_policy" "ses-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0001-ses-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role.ecs_execution_role_main will be created
+ resource "aws_iam_role" "ecs_execution_role_main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "obornes-sdbx-cs-FR-ORV-A0001-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role.ecs_task_role_main will be created
+ resource "aws_iam_role" "ecs_task_role_main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_execution_role_main_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_execution_role_main_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-execution-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_execution_role_secrets_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_execution_role_secrets_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-execution-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_base_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_base_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_cloudwatch_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_cloudwatch_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_main_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_main_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_main_telemetry_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_main_telemetry_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_parameters_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_parameters_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_secrets_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_secrets_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_ses_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_ses_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_iam_role_policy_attachment.ecs_task_role_ssm_attachment will be created
+ resource "aws_iam_role_policy_attachment" "ecs_task_role_ssm_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = "obornes-sdbx-cs-FR-ORV-A0001-ecs-task-role"
    }

  # module.ecs_simulator["FR-ORV-A0001"].aws_security_group.service-sg will be created
+ resource "aws_security_group" "service-sg" {
      + arn                    = (known after apply)
      + description            = "Security group for App obornes-sdbx-cs-FR-ORV-A0001-cs-FR-ORV-A0001"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "obornes-sdbx-cs-FR-ORV-A0001-cs-FR-ORV-A0001"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0cc8ac83482581a51"
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_ecs_service.service-definition will be created
+ resource "aws_ecs_service" "service-definition" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-west-1:192351105085:cluster/obornes-sdbx"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "obornes-sdbx-cs-FR-ORV-A0002-cs-FR-ORV-A0002"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 100
        }

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = false
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0090fb2d3bfc17fc5",
              + "subnet-021e5d9037c4f1832",
              + "subnet-0fa808640b5ce66b5",
            ]
        }
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_ecs_task_definition.task-definition will be created
+ resource "aws_ecs_task_definition" "task-definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + environment      = [
                      + {
                          + name  = "CP_ID"
                          + value = "FR*ORV*A0002"
                        },
                      + {
                          + name  = "ENV"
                          + value = "sdbx"
                        },
                      + {
                          + name  = "WS_URL"
                          + value = "ws://server.16.ocpp.obornes.solidstudio.io"
                        },
                    ]
                  + essential        = true
                  + image            = "192351105085.dkr.ecr.eu-west-1.amazonaws.com/simulator:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "obornes-sdbx-cs-FR-ORV-A0002-cs-FR-ORV-A0002"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "logs"
                        }
                    }
                  + memory           = 512
                  + name             = "cs-FR-ORV-A0002"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:eu-west-1:192351105085:secret:cs_simulator/cp_password-XPcOCk:cp_password::"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "obornes-sdbx-cs-FR-ORV-A0002-cs-FR-ORV-A0002"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_policy.app-access-policy will be created
+ resource "aws_iam_policy" "app-access-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0002-ecs-app-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_policy.log-driver-policy will be created
+ resource "aws_iam_policy" "log-driver-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0002-ecs-log-drive-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_policy.opentelemetry-policy will be created
+ resource "aws_iam_policy" "opentelemetry-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0002-opentelemetry-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_policy.parameters-policy will be created
+ resource "aws_iam_policy" "parameters-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0002-parameters-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-west-1:192351105085:parameter/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_policy.secrets-policy will be created
+ resource "aws_iam_policy" "secrets-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0002-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_policy.ses-policy will be created
+ resource "aws_iam_policy" "ses-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "obornes-sdbx-cs-FR-ORV-A0002-ses-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_role.ecs_execution_role_main will be created
+ resource "aws_iam_role" "ecs_execution_role_main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "obornes-sdbx-cs-FR-ORV-A0002-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_simulator["FR-ORV-A0002"].aws_iam_role.ecs_task_role_main will be created
+ resource "aws_iam_role" "ecs_task_role_main" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "obornes-sdbx-cs-FR-ORV-A0002-ecs-task-role"
      + name_prefix           = (known after apply)
      + path            
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.